Revit 2026 API

# ReinforcementAbbreviationTag Class

---

This class is used to access the Area or Path Reinforcement abbreviation tag data. It stores abbreviation tag value and abbreviation type.

SystemObject Autodesk.Revit.DB.StructureReinforcementAbbreviationTag

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ReinforcementAbbreviationTag : IDisposable
```
```vb
Public Class ReinforcementAbbreviationTag
	Implements IDisposable
```
```cpp
public ref class ReinforcementAbbreviationTag : IDisposable
```
```fsharp
type ReinforcementAbbreviationTag =
    class
        interface IDisposable
    end
```

The ReinforcementAbbreviationTag type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ReinforcementAbbreviationTag | Constructs a new ReinforcementAbbreviationTag. |

|  | Name | Description |
| --- | --- | --- |
|  | AbbreviationTag | The abbreviation tag value. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | TypeTag | The abbreviation tag type. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ReinforcementAbbreviationTag |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Structure Namespace